In [2]:
import os


import mysql.connector
# from mysql imprt connector
from dotenv import load_dotenv

import pandas as pd

In [3]:
load_dotenv()

#print(os.getenv('USER'))
user = os.getenv('USER')
password = os.getenv('PASSWORD')
host = os.getenv('HOST')
database = 'swiftmarket'

In [4]:
connection = mysql.connector.connect(user = user,
                                     password = password,
                                     host=host,
                                     database = database)
cursor = connection.cursor()

In [5]:
connection.is_connected()

True

In [6]:
query = '''show tables'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

('categories',)
('customers',)
('employees',)
('salesdata',)
('subcategories',)
('suppliers',)

In [7]:
def func():
    result = pd.DataFrame(data=rows, columns=cursor.column_names)

    return result
func()

  Tables_in_swiftmarket
0            categories
1             customers
2             employees
3             salesdata
4         subcategories
5             suppliers

In [8]:
def read_query(query):
    
    cursor.execute(query)
    rows = cursor.fetchall()
    
    return pd.DataFrame(data=rows, columns=cursor.column_names)

In [9]:
query = '''select * from categories limit 5'''
read_query(query)

   CategoryID                     CategoryName
0      500100          Electronics and Gadgets
1      500101      Home and Kitchen Appliances
2      500102     Outdoor and Sports Equipment
3      500103     Health and Wellness Products
4      500104  Books and Educational Materials

In [10]:
query = '''select * from customers limit 5'''
read_query(query)

,CustomerID,FirstName,LastName,Email,Phone,Address,State
0,C-2023-100-1,Mahika,Sunder,MahikaSunder_11@zmail.com,03412176590,"H.No. 155, Chana",Assam
1,C-2023-100-10,Zeeshan,Vasa,ZeeshanVasa_1@zmail.com,+911151051656,"52, Roy Nagar",Tripura
2,C-2023-100-100,Aaina,Sachdeva,AainaSachdeva_9@zmail.com,+918834507719,"75/92, Kade Marg",Nagaland
3,C-2023-100-101,Shray,Bajwa,ShrayBajwa_11@zmail.com,07410498662,"45, Bora Ganj",Manipur
4,C-2023-100-102,Navya,Dash,NavyaDash_5@zmail.com,+917644200850,70/782\nBahl Road,Kerala

In [11]:
query = '''select s.saledate,c.firstname,s.totalprice 
from salesdata s
join customers c
on s.customerid=c.customerid
order by s.saledate;'''
read_query(query)

         saledate firstname totalprice
0      2023-01-01     Shalv  208626.00
1      2023-01-01     Kiara   28797.00
2      2023-01-01    Ranbir   70235.00
3      2023-01-01     Shray  104188.00
4      2023-01-01   Samarth   69694.00
...           ...       ...        ...
11996  2023-12-30     Gatik  347710.00
11997  2023-12-30  Indrajit  136720.00
11998  2023-12-30      Azad  111075.00
11999  2023-12-30     Sahil   99402.00
12000  2023-12-30      Tiya   74970.00

[12001 rows x 3 columns]

In [12]:
query = """select * from employees;"""

query = """select firstname, email
           from employees limit 5;"""

read_query(query)

  firstname                   email
0     Fateh  fname.lname@swiftm.org
1    Chirag  fname.lname@swiftm.org
2   Dhanush  fname.lname@swiftm.org
3     Anika  fname.lname@swiftm.org
4      Keya  fname.lname@swiftm.org

In [13]:
query = 'select * from customers limit 4;'
read_query(query)

,CustomerID,FirstName,LastName,Email,Phone,Address,State
0,C-2023-100-1,Mahika,Sunder,MahikaSunder_11@zmail.com,03412176590,"H.No. 155, Chana",Assam
1,C-2023-100-10,Zeeshan,Vasa,ZeeshanVasa_1@zmail.com,+911151051656,"52, Roy Nagar",Tripura
2,C-2023-100-100,Aaina,Sachdeva,AainaSachdeva_9@zmail.com,+918834507719,"75/92, Kade Marg",Nagaland
3,C-2023-100-101,Shray,Bajwa,ShrayBajwa_11@zmail.com,07410498662,"45, Bora Ganj",Manipur

In [14]:
query = 'show tables;'
read_query(query)

  Tables_in_swiftmarket
0            categories
1             customers
2             employees
3             salesdata
4         subcategories
5             suppliers

In [15]:
query = """Select * from salesdata limit 3;"""
read_query(query)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00

In [16]:
query = """Select s.customerid, c.firstname,s.saledate,s.totalprice
from salesdata s
join customers c
on s.customerid = c.customerid
limit 5;"""

read_query(query)

     customerid firstname    saledate totalprice
0  C-2023-100-1    Mahika  2023-07-22   67312.00
1  C-2023-100-1    Mahika  2023-05-23  176466.00
2  C-2023-100-1    Mahika  2023-11-26  190332.00
3  C-2023-100-1    Mahika  2023-03-31  205080.00
4  C-2023-100-1    Mahika  2023-11-22   14174.00

In [17]:
query = 'show tables;'
read_query(query)

  Tables_in_swiftmarket
0            categories
1             customers
2             employees
3             salesdata
4         subcategories
5             suppliers

In [18]:
query = 'select * from salesdata limit 10;'
read_query(query)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00
3,23003,C-2023-100-72,6006,1016,2023-08-01,2,117644.00
4,23004,C-2023-100-142,6030,1067,2023-03-06,5,336560.00
5,23005,C-2023-100-72,6015,1012,2023-11-22,5,396935.00
6,23006,C-2023-100-78,6015,1044,2023-10-26,5,396935.00
7,23007,C-2023-100-36,6017,1018,2023-03-29,5,295510.00
8,23008,C-2023-100-147,6030,1049,2023-01-17,3,201936.00
9,23009,C-2023-100-7,6019,1047,2023-07-19,4,56188.00